<a href="https://colab.research.google.com/github/Olumighty25/MyFirstColabNotebook/blob/master/Week6_Class2_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [ ]:
# !pip install ipython-sql
#!pip install ipython-sql

Requirement already satisfied: ipython-sql in c:\users\user\anaconda3\lib\site-packages (0.4.0)
Requirement already satisfied: ipython>=1.0 in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (7.22.0)
Requirement already satisfied: ipython-genutils>=0.1.0 in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.2.0)
Requirement already satisfied: sqlparse in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.4.2)
Requirement already satisfied: prettytable<1 in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (0.7.2)
Requirement already satisfied: sqlalchemy>=0.6.7 in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (1.4.7)
Requirement already satisfied: six in c:\users\user\anaconda3\lib\site-packages (from ipython-sql) (1.15.0)
Requirement already satisfied: pygments in c:\users\user\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (2.8.1)
Requirement already satisfied: decorator in c:\users\user\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.6)
Requirement already satisfied: colorama in c:\users\user\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.4.4)
Requirement already satisfied: prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0 in c:\users\user\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (3.0.17)
Requirement already satisfied: jedi>=0.16 in c:\users\user\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.17.2)
Requirement already satisfied: setuptools>=18.5 in c:\users\user\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (52.0.0.post20210125)
Requirement already satisfied: pickleshare in c:\users\user\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.7.5)
Requirement already satisfied: traitlets>=4.2 in c:\users\user\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (5.0.5)
Requirement already satisfied: backcall in c:\users\user\anaconda3\lib\site-packages (from ipython>=1.0->ipython-sql) (0.2.0)
Requirement already satisfied: parso<0.8.0,>=0.7.0 in c:\users\user\anaconda3\lib\site-packages (from jedi>=0.16->ipython>=1.0->ipython-sql) (0.7.0)
Requirement already satisfied: wcwidth in c:\users\user\anaconda3\lib\site-packages (from prompt-toolkit!=3.0.0,!=3.0.1,<3.1.0,>=2.0.0->ipython>=1.0->ipython-sql) (0.2.5)
Requirement already satisfied: greenlet!=0.4.17 in c:\users\user\anaconda3\lib\site-packages (from sqlalchemy>=0.6.7->ipython-sql) (1.0.0)

In [1]:
# Load the sql module
%load_ext sql

# Create/connect to the database file

In [2]:
%sql sqlite:///first.sqlite

'Connected: @first.sqlite'

In [ ]:
# %sqlite:///new.db3

In [4]:
%%sql

--# drop any existing table in the database

DROP TABLE IF EXISTS students;
DROP TABLE IF EXISTS address;
DROP TABLE IF EXISTS payments;

 * sqlite:///first.sqlite
Done.
Done.
Done.

[]

# Checking the content of database

In [8]:
%sql SELECT name FROM sqlite_master WHERE type='table';

 * sqlite:///first.sqlite
Done.

[]

# Creating the tables

In [9]:
%%sql

--#creating the students table

CREATE TABLE students(SN INTEGER NOT NULL,
                      registration_id TEXT PRIMARY KEY NOT NULL,
                      firstName TEXT NOT NULL,
                      lastName TEXT NOT NULL,
                      age int NOT NULL
);

 * sqlite:///first.sqlite
Done.

[]

In [10]:
%%sql

--# creating the address table

CREATE TABLE address(
    reg_id TEXT  NOT NULL, 
    house_number INTEGER NOT NULL,
    street_name TEXT NOT NULL,
    city TEXT NOT NULL,
    FOREIGN KEY(reg_id) REFERENCES students(registration_id)
);

 * sqlite:///first.sqlite
Done.

[]

In [11]:
%%sql
--# creating the payments table
CREATE TABLE payments(
    payment_id TEXT  NOT NULL, 
    amount_paid INTEGER NOT NULL,
    FOREIGN KEY(payment_id) REFERENCES students(registration_id)
);

 * sqlite:///first.sqlite
Done.

[]

# Checking the contents of the table

In [12]:
%%sql
SELECT * FROM students;

 * sqlite:///first.sqlite
Done.

[]

In [13]:
%sql SELECT * FROM payments;

 * sqlite:///first.sqlite
Done.

[]

In [14]:
%%sql
SELECT * FROM address;

 * sqlite:///first.sqlite
Done.

[]

# Populating the tables

In [15]:
%%sql

INSERT INTO students(SN, registration_id, firstName, lastName, age)
    VALUES(1, 'YDEV/2019/001', 'James', 'Murphy', 25), (2, 'YDEV/2019/002', 'Anthony', 'Philip', 19),
    (3, 'YDEV/2019/003', 'Timothy', 'Arinze', 36), (4, 'YDEV/2019/004', 'Anne', 'Kazeem', 21),
    (5, 'YDEV/2019/005', 'Lope', 'Smith', 23), (6, 'YDEV/2019/006', 'Adeoba', 'Ajayi', 25),
    (7, 'YDEV/2019/007', 'Franklin', 'Kayode', 15), (8, 'YDEV/2019/008', 'Abiola', 'Kabeeb', 26),
    (9, 'YDEV/2019/009', 'Bashirat', 'Chidi', 18), (10, 'YDEV/2019/010', 'Dami', 'Ibraheem', 42),
    (11, 'YDEV/2019/011', 'Adetokunbo', 'White', 23), (12, 'YDEV/2019/012', 'Udoaka', 'Alozie', 37),
    (13, 'YDEV/2019/013', 'Whyte', 'Victor', 16), (14, 'YDEV/2019/014', 'Damilare', 'Clarke', 51),
    (15, 'YDEV/2019/015', 'Ife', 'Kane', 33), (16, 'YDEV/2019/016', 'Sultan', 'Ebube', 19),
    (17, 'YDEV/2019/017', 'Adesola', 'Dennis', 46), (18, 'YDEV/2019/018', 'Nonye', 'Mathiaz', 33),
    (19, 'YDEV/2019/019', 'William', 'Hector', 65), (20, 'YDEV/2019/020', 'Yusuf', 'Gahandi', 44),
    (21, 'YDEV/2019/021', 'Abosede', 'Graig', 14), (22, 'YDEV/2019/022', 'Whyte', 'Fatai', 20),
    (23, 'YDEV/2019/023', 'Eniola', 'Galileo', 26), (24, 'YDEV/2019/024', 'Gbemi', 'Melone', 24);

 * sqlite:///first.sqlite
24 rows affected.

[]

In [16]:
%%sql
SELECT * FROM students;

 * sqlite:///first.sqlite
Done.

[(1, 'YDEV/2019/001', 'James', 'Murphy', 25),
 (2, 'YDEV/2019/002', 'Anthony', 'Philip', 19),
 (3, 'YDEV/2019/003', 'Timothy', 'Arinze', 36),
 (4, 'YDEV/2019/004', 'Anne', 'Kazeem', 21),
 (5, 'YDEV/2019/005', 'Lope', 'Smith', 23),
 (6, 'YDEV/2019/006', 'Adeoba', 'Ajayi', 25),
 (7, 'YDEV/2019/007', 'Franklin', 'Kayode', 15),
 (8, 'YDEV/2019/008', 'Abiola', 'Kabeeb', 26),
 (9, 'YDEV/2019/009', 'Bashirat', 'Chidi', 18),
 (10, 'YDEV/2019/010', 'Dami', 'Ibraheem', 42),
 (11, 'YDEV/2019/011', 'Adetokunbo', 'White', 23),
 (12, 'YDEV/2019/012', 'Udoaka', 'Alozie', 37),
 (13, 'YDEV/2019/013', 'Whyte', 'Victor', 16),
 (14, 'YDEV/2019/014', 'Damilare', 'Clarke', 51),
 (15, 'YDEV/2019/015', 'Ife', 'Kane', 33),
 (16, 'YDEV/2019/016', 'Sultan', 'Ebube', 19),
 (17, 'YDEV/2019/017', 'Adesola', 'Dennis', 46),
 (18, 'YDEV/2019/018', 'Nonye', 'Mathiaz', 33),
 (19, 'YDEV/2019/019', 'William', 'Hector', 65),
 (20, 'YDEV/2019/020', 'Yusuf', 'Gahandi', 44),
 (21, 'YDEV/2019/021', 'Abosede', 'Graig', 14),
 (22, 'YDEV/2019/022', 'Whyte', 'Fatai', 20),
 (23, 'YDEV/2019/023', 'Eniola', 'Galileo', 26),
 (24, 'YDEV/2019/024', 'Gbemi', 'Melone', 24)]

In [17]:
%%sql

INSERT INTO students(SN, registration_id, firstName, lastName, age)
    VALUES(25, 'YDEV/2019/025', 'Olumide', 'Olaoye', 26);

 * sqlite:///first.sqlite
1 rows affected.

[]

In [18]:
%%sql

SELECT * FROM students;

 * sqlite:///first.sqlite
Done.

[(1, 'YDEV/2019/001', 'James', 'Murphy', 25),
 (2, 'YDEV/2019/002', 'Anthony', 'Philip', 19),
 (3, 'YDEV/2019/003', 'Timothy', 'Arinze', 36),
 (4, 'YDEV/2019/004', 'Anne', 'Kazeem', 21),
 (5, 'YDEV/2019/005', 'Lope', 'Smith', 23),
 (6, 'YDEV/2019/006', 'Adeoba', 'Ajayi', 25),
 (7, 'YDEV/2019/007', 'Franklin', 'Kayode', 15),
 (8, 'YDEV/2019/008', 'Abiola', 'Kabeeb', 26),
 (9, 'YDEV/2019/009', 'Bashirat', 'Chidi', 18),
 (10, 'YDEV/2019/010', 'Dami', 'Ibraheem', 42),
 (11, 'YDEV/2019/011', 'Adetokunbo', 'White', 23),
 (12, 'YDEV/2019/012', 'Udoaka', 'Alozie', 37),
 (13, 'YDEV/2019/013', 'Whyte', 'Victor', 16),
 (14, 'YDEV/2019/014', 'Damilare', 'Clarke', 51),
 (15, 'YDEV/2019/015', 'Ife', 'Kane', 33),
 (16, 'YDEV/2019/016', 'Sultan', 'Ebube', 19),
 (17, 'YDEV/2019/017', 'Adesola', 'Dennis', 46),
 (18, 'YDEV/2019/018', 'Nonye', 'Mathiaz', 33),
 (19, 'YDEV/2019/019', 'William', 'Hector', 65),
 (20, 'YDEV/2019/020', 'Yusuf', 'Gahandi', 44),
 (21, 'YDEV/2019/021', 'Abosede', 'Graig', 14),
 (22, 'YDEV/2019/022', 'Whyte', 'Fatai', 20),
 (23, 'YDEV/2019/023', 'Eniola', 'Galileo', 26),
 (24, 'YDEV/2019/024', 'Gbemi', 'Melone', 24),
 (25, 'YDEV/2019/025', 'Olumide', 'Olaoye', 26)]